In [3]:
import pandas as pd
import numpy as np

In [11]:
df = pd.DataFrame(np.arange(10, 22).reshape(3,4), index=['a', 'b', 'c'], columns=['A','B','C','D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [12]:
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [18]:
df.loc['b' : 'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [22]:
df['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [30]:
df.loc[['b' ,'c']]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [45]:
df.A >15

a    False
b    False
c     True
Name: A, dtype: bool

In [46]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [47]:
def select_rows(df):
    return df.A > 15

In [48]:
select_rows(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [49]:
df.loc[select_rows(df)]

    A   B   C   D
c  18  19  20  21

In [51]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4), columns=["A", "B", "C", "D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [52]:
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [53]:
df2[1:2]

    A   B   C   D
1  14  15  16  17

In [55]:
df2.loc[[1]]

    A   B   C   D
1  14  15  16  17

In [56]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [74]:
df.loc[['a','b'], ['B', 'D']]

    B   D
a  11  13
b  15  17

In [78]:
df.loc[df.A >10,['C', "D"]]

    C   D
b  16  17
c  20  21

In [80]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [81]:
df.iloc[0,1]

11

In [86]:
df.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int32

In [90]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int32

In [99]:
df.iloc[:, :]

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [102]:
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int32

In [116]:
df.iloc[-1] = df.iloc[-1] * 2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

### 연습문제

In [139]:
df = pd.DataFrame(np.arange(1, 26).reshape(5,5), index = ['a', 'b', 'c', 'd', 'e'], columns=['A', 'B', 'C', 'D', 'E'])
df

    A   B   C   D   E
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25

In [141]:
df['A']

a     1
b     6
c    11
d    16
e    21
Name: A, dtype: int32

In [142]:
df['A']['a']

1

In [144]:
df['a' : 'c']

    A   B   C   D   E
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15

In [147]:
df[['A','C']]

    A   C
a   1   3
b   6   8
c  11  13
d  16  18
e  21  23

In [148]:
df

    A   B   C   D   E
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25

In [149]:
df.loc['a']['A']

1

In [152]:
df.loc[['a']]

   A  B  C  D  E
a  1  2  3  4  5

In [169]:
df.loc[['a', 'd']][['A', 'D']]

    A   D
a   1   4
d  16  19

In [193]:
df

    A   B   C   D   E
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25

In [189]:
df.iloc[1][3]

9

In [194]:
df.iloc[1:3,1:3]

    B   C
b   7   8
c  12  13

In [195]:
df.iloc[1,3]

9

In [199]:
df.iloc[:-1,:-1]

    A   B   C   D
a   1   2   3   4
b   6   7   8   9
c  11  12  13  14
d  16  17  18  19

In [200]:
df.iloc[:-1]

    A   B   C   D   E
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20

In [201]:
df.iloc[range(0,5)]

    A   B   C   D   E
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25